Revit 2027 API
BuiltInFailures.SiteFailures.SurfaceSplitError Property
 The splitting boundary must split the Surface into exactly two pieces.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SurfaceSplitError { get; }
Public Shared ReadOnly Property SurfaceSplitError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SurfaceSplitError {
	FailureDefinitionId^ get ();
}
static member SurfaceSplitError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace